#include <iostream>
#include <cmath>
using namespace std;

int main() {
    double a, b, y;
    a = 3;
    b = 0.521;

    y = cbrt(pow((0.127 * exp(b / a)) / (1 - cbrt(cos((b / a) * M_PI))), 2));

    cout << "a=" << a << " b=" << b <<"\n";
    cout << "y=" << y;

}
/* ВІДПОВІДІ НА КЛЮЧОВІ ПИТАННЯ
3.1 Що таке оператори?
Оператори – це знаки або ключові слова, які вказують яку дію виконати (наприклад +, -, *, /).

3.2 Що таке операнди?
Операнди – це дані або змінні, до яких застосовуються оператори ( a + b  операнди –  a , b).

3.3 Які бувають функції?
Функції бувають вбудовані і користувацькі.

3.4 Як в мові програмування С++ позначається квадратний корінь?
sqrt(x) з бібліотеки <cmath>.

3.5 Як в мові програмування С++ отримати остачу від ділення?
Для цілих чисел використовується оператор % ( 7 % 3 = 1).

*/
